<a href="https://colab.research.google.com/github/Data-Intelligence-Mastery/data_science_interview_questions/blob/master/Q017_SQL_null.ipynb" target="_parent"><img src="https://colab.research.google.com/assets/colab-badge.svg" alt="Open In Colab"/></a>

## In SQL, null = null?

`SQL, Database Querying`

In SQL, what will be the result of the below query?

select case when `null = null` then 'Yes' else 'No' end as Result;

First let's create a database whose name is **employees**

In [1]:
import pandas as pd

employees = {'name': ['John', 'Harry', 'Sam', 'Tina'], 'job_role': ['Analyst', 'Administrative Business Partner', 'Software Engineer', 'Analyst']}
employees = pd.DataFrame(employees)

from tabulate import tabulate as tb
print(tb(employees, headers='keys', tablefmt='pretty'))


import sqlite3

conn = sqlite3.connect('employees.db')
c = conn.cursor()

c.execute('CREATE TABLE employees (name, job_role)')
conn.commit()

employees.to_sql('employees', conn, if_exists = 'replace', index=True)
c.execute(''' SELECT * FROM employees ''')

#for row in c.fetchall():
#  print(row)

+---+-------+---------------------------------+
|   | name  |            job_role             |
+---+-------+---------------------------------+
| 0 | John  |             Analyst             |
| 1 | Harry | Administrative Business Partner |
| 2 |  Sam  |        Software Engineer        |
| 3 | Tina  |             Analyst             |
+---+-------+---------------------------------+

In [2]:
c.execute(''' SELECT * FROM employees
              WHERE null is null
              ''')

for row in c.fetchall():
  print(row)

(0, 'John', 'Analyst')
(1, 'Harry', 'Administrative Business Partner')
(2, 'Sam', 'Software Engineer')
(3, 'Tina', 'Analyst')

It outputs all data when `null is null` because this is a TRUE statement.

In [0]:
c.execute(''' SELECT * FROM employees
              WHERE null = null
              ''')

for row in c.fetchall():
  print(row)

No output when using `null=null` because this is an `unknown` statement.

For more background, check [here](https://modern-sql.com/concept/three-valued-logic)